{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"data_format": "channels_last", "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 32, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "name": "conv2d_1", "kernel_size": [5, 5], "trainable": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "conv2d_2", "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 32, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_1", "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_2", "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}